#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "nodejs-app-dev-repository"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "CreatedAt" = "2020-05-24"
          + "ManagedBy" = "Terraform"
          + "Owner"     = "Cleber Gasparoto"
          + "Project"   = "Curso AWS com Terraform"
          + "Service"   = "Auto Scaling App with ECS Fargate - ECR Repository"
        }
    }

  # null_resource.docker will be created
  + resource "null_resource" "docker" {
      + id       = (known after apply)
      + triggers = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + arn            = (known after apply)
  + name           = "nodejs-app-dev-repository"
  + registry_id    = (known after apply)
  + repository_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```
</details>

*Pusher: @chgasparoto, Action: `pull_request`, Working Directory: `06-ecs-fargate/terraform/ecr`, Workflow: `Create terraform plan`*